{
  "phase": "sdd",
  "document": "grimoires/loa/sdd.md",
  "timestamp": "2026-02-19T20:32:39Z",
  "consensus_summary": {
    "high_consensus_count": 4,
    "disputed_count": 1,
    "low_value_count": 0,
    "blocker_count": 5,
    "model_agreement_percent": 90
  },
  "high_consensus": [
    {
      "id": "IMP-001",
      "description": "Define error taxonomy for gen/validate scripts — parse error, missing file, partial scan — with non-zero exit codes and fail-closed behavior. Without minimum-field gates, gen/validate sharing same broken logic gives false confidence.",
      "average_score": 900
    },
    {
      "id": "IMP-002",
      "description": "Route extraction needs to define supported Express patterns and explicit fallback behavior for unresolvable patterns (dynamic registration, conditional routes, computed strings).",
      "average_score": 785
    },
    {
      "id": "IMP-003",
      "description": "Define stability semantics for 'guaranteed-stable' endpoints — versioning (path/header/semver), compatibility guarantees, deprecation windows, and promotion criteria from Tier 2 to Tier 1.",
      "average_score": 835
    },
    {
      "id": "IMP-004",
      "description": "Document recognized AST patterns for extractor with examples and non-examples. Add a linter/gate that flags unrecognized route registration constructs in scanned directories.",
      "average_score": 810
    }
  ],
  "disputed": [
    {
      "id": "IMP-008",
      "description": "Accessibility/i18n guidelines for documentation. GPT scored low (320), Opus higher (680). Not tied to current scope.",
      "average_score": 500
    }
  ],
  "blockers": [
    {
      "id": "SKP-001",
      "concern": "No mechanism to detect behavioral drift in 70+ indexed endpoints. Smoke tests only cover 7 stable. Indexed endpoints' auth/status/response can change silently.",
      "severity_score": 900
    },
    {
      "id": "SKP-002",
      "concern": "Route extraction via ts-morph is likely incomplete for real-world Express patterns (dynamic composition, HOFs, env-gated, computed strings). Baseline count gate can still pass with wrong routes.",
      "severity_score": 860
    },
    {
      "id": "SKP-003",
      "concern": "Citation pinning depends on GitHub API availability, tag immutability, network access. No offline mode, no retry/backoff, no caching of already-pinned refs.",
      "severity_score": 760
    },
    {
      "id": "SKP-004",
      "concern": "BUTTERFREEZONE extraction determinism not proven across OS/filesystem/Node/ts-morph versions. Glob order, locale, line endings can vary.",
      "severity_score": 740
    },
    {
      "id": "SKP-005",
      "concern": "AUTH_BYPASS and dev JWKS are documentation-only safeguards with no code-level enforcement. Docs teaching shortcuts get copied to production.",
      "severity_score": 720
    }
  ]
}
